### [double-click to type in] Input your name, your netid here:Jingfan Zhang oqh8985

---

Instructions:

1. First save this notebook to your drive, then work on it.
2. In order to connect to the database, you need to upload the database file to your current working directory.
3. DO NOT change the setup coding blocks. You should only put queries in the specified locations.
4. After you are done, save and download your notebook as ipynb file, and submit it to canvas. Make sure you keep the output in the notebook.

In [1]:
#### Execute this coding block only! DO NOT change anything!!

import csv, sqlite3
import pandas as pd
from sqlite3 import Error

def create_connection(db_file):
  conn = None
  try:
      conn = sqlite3.connect(db_file)
  except Error as e:
      print("create_connection error:")
      print(e)
  return conn

def execute_query(conn, query):
  return pd.read_sql_query(query,conn)

def display_result(r):
  display(r.style.hide(axis='index'))

conn1 = create_connection('SalesOrders.db')
conn2 = create_connection('SchoolScheduling.db')

In [ ]:
####TODO 1: put your sql query in the following three single quotes
query1='''
select count(OrderNumber) from Orders
join Employees on Orders.EmployeeID = Employees.EmployeeID
where Employees.EmpFirstName = 'Mary'
'''
r = execute_query(conn1,query1)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 2: put your sql query in the following three single quotes
query2='''
select SUM(d.QuotedPrice * d.QuantityOrdered) from Order_Details d
join Orders o on d.OrderNumber = o.OrderNumber
join Customers c on o.CustomerID = c.CustomerID
where c.CustFirstName = 'Alaina'
'''
r = execute_query(conn1,query2)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 3: put your sql query in the following three single quotes
query3='''
select OrderDate, Count(*) from Orders
GROUP BY OrderDate
ORDER BY OrderDate
'''
r = execute_query(conn1,query3)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 4: put your sql query in the following three single quotes
query4='''
SELECT CustState, Count(*) as CustCount from Customers
Group By CustState
Order By CustCount DESC
LIMIT 1
'''
r = execute_query(conn1,query4)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 5: put your sql query in the following three single quotes
query5='''
select VendName, VendState from Vendors v
join Product_Vendors pv on v.VendorID = pv.VendorID
join Products p on pv.ProductNumber = p.ProductNumber
where p.ProductName = 'Cosmic Elite Road Warrior Wheels'
'''
r = execute_query(conn1,query5)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 6: put your sql query in the following three single quotes
query6='''
select ProductName from Products p
join Product_Vendors pv on p.ProductNumber = pv.ProductNumber
join Vendors v on pv.VendorID = v.VendorID
where VendState = 'NY'
'''
r = execute_query(conn1,query6)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
####TODO 7: put your sql query in the following three single quotes
query7='''
select CustomerID, CustFirstName, count(*) from Customers c
join Orders o on c.CustomerID = o.CustomerID
group by c.CustomerID, c.CustFirstName
Order By count(*) DESC
LIMIT 6
'''
r = execute_query(conn1,query7)
display_result(r)

In [ ]:
#leave this cell blank

In [2]:
####TODO 8: put your sql query in the following three single quotes
query8='''
select StaffID, StfFirstName, StfLastname,Salary, DateHired from Staff
join Departments on Departments.DeptChair = Staff.StaffID
'''
r = execute_query(conn2,query8)
display_result(r)

In [ ]:
#leave this cell blank

In [3]:
####TODO 9: put your sql query in the following three single quotes
query9='''
select StudFirstName, StudLastName, m.Major, COUNT(ss.ClassStatus) from Students s
join Majors m on m.majorID = s.studMajor
join Student_Schedules ss on ss.studentID = s.StudentID
WHERE ss.ClassStatus < "3"
GROUP BY StudFirstName;
'''
r = execute_query(conn2,query9)
display_result(r)

In [ ]:
#leave this cell blank

In [4]:
####TODO 10: put your sql query in the following three single quotes
query10='''
select distinct c.ClassID, c.Credits
from Classes c
join Class_Rooms r on r.ClassRoomID = c.ClassRoomID
join Buildings b on b.BuildingCode = r.BuildingCode
join Student_Schedules ss on ss.ClassID = c.ClassID
WHERE BuildingName = "College Center"
      and SemesterNumber < 2
      and (MondaySchedule+TuesdaySchedule+WednesdaySchedule+ThursdaySchedule+FridaySchedule+SaturdaySchedule)>=2
      and ClassStatus < 3
'''
r = execute_query(conn2,query10)
display_result(r)

In [ ]:
#leave this cell blank

In [ ]:
#### Execute this block after you are done!!
conn1.close()
conn2.close()